#+TITLE: haushalt
#+CATEGORY: haushalt
#+TAGS: review bug feature research design 
#+TODO: TODO(t) STARTED(s!) | FIXED(f!) DONE(d!) 
#+TODO: CANCELED(c@)
#+STARTUP: overview 
#+STARTUP: hidestars
#+PROPERTY: Assigned_to_ALL kordano jeth64
#+OPTIONS: d:nil
**** Overview

A web service for organizing your domestic resources. 

**** Usage

#+BEGIN_SRC Bash
lein run
#+END_SRC

**** TODOs
***** DONE compile possible back- and frontend architecture	     :design:
      CLOSED: [2015-07-09 Do 15:15] DEADLINE: <2015-07-09 Do>
     :LOGBOOK:  
     - State "DONE"       from "TODO"       [2015-07-09 Do 15:15]
     CLOCK: [2015-07-09 Do 10:44]--[2015-07-09 Do 11:11] =>  0:27
     - Note taken on [2015-07-09 Do 10:27] \\
       - backend: 
         - [[https://github.com/http-kit/http-kit][http-kit]] : http-server
         - [[http://docs.datomic.com/][datomic]] : database
         - [[https://github.com/cgrand/][enlive]] : html templating
         - [[https://github.com/ptaoussanis/timbre][timbre]] : logging
         - [[https://github.com/clojurewerkz/mailer][mailer]] : user management by mailing
       - frontend:
         - [[https://github.com/omcljs/om][om]] : react in cljs, simple ui representation, virtual dom
         - [[https://github.com/ckirkendall/kioo][kioo]] : frontend templating
         - [[https://github.com/ptaoussanis/sente][sente]] : websockets for client-server-communication
       - dev tools:
         - [[https://github.com/bhauman/lein-][figwheel]]: non-plus-ultra frontend refresh tool
	 - [[https://github.com/weavejester/environ][environ]]: environment management
     CLOCK: [2015-07-09 Do 10:26]--[2015-07-09 Do 10:37] =>  0:11
     :END:      
     :PROPERTIES:
     :Created: [2015-07-09 Do 10:19]
     :Assigned_to: kordano
     :ORDERED:  t
     :END:
***** STARTED build prototype input and table frontend using om and figwheel :feature:
      DEADLINE: <2015-07-10 Fr>
     :LOGBOOK:  
     CLOCK: [2015-07-09 Do 15:53]--[2015-07-09 Do 16:32] =>  0:39
     - State "STARTED"    from "TODO"       [2015-07-09 Do 15:51]
     CLOCK: [2015-07-09 Do 12:41]--[2015-07-09 Do 13:13] =>  0:32
     CLOCK: [2015-07-09 Do 11:17]--[2015-07-09 Do 11:40] =>  0:23
     :END:      
     :PROPERTIES:
     :Created: [2015-07-09 Do 10:09]
     :Assigned_to: kordano
     :END:
***** TODO design data model					     :design:
     DEADLINE: <2015-07-11 Sa>
     :LOGBOOK:  
     - Note taken on [2015-07-09 Do 10:23] \\
       What is the first use case?
     CLOCK: [2015-07-09 Do 10:16]--[2015-07-09 Do 10:25] =>  0:09
     CLOCK: [2015-07-08 Mi 11:15]--[2015-07-08 Mi 11:26] =>  0:11
     :END:      
     :PROPERTIES:
     :Created: [2015-07-08 Mi 11:14]
     :Assigned_to: kordano
     :END:
***** STARTED sketch input and finance-table view		     :design:
      DEADLINE: <2015-07-10 Fr>
      :LOGBOOK: 
      - State "STARTED"    from "TODO"       [2015-07-09 Do 15:51]
      CLOCK: [2015-07-08 Mi 11:01]--[2015-07-08 Mi 11:14] =>  0:13
      :END:      
    :PROPERTIES:
    :Created: [2015-07-06 Mo 13:21]
    :Assigned_to: kordano
    :END:
***** DONE publish first dev blog post				     :design:
      CLOSED: [2015-07-06 Mo 17:11] DEADLINE: <2015-07-09 Do>
      :LOGBOOK:
      - Note taken on [2015-07-09 Do 10:27] \\
	See [[http://lambda-kollektiv.github.io/2015/07/06/road_to_haushalt/][blog post]]
      - State "DONE"       from "STARTED"    [2015-07-06 Mo 17:11]
      - State "STARTED"    from "TODO"       [2015-07-06 Mo 17:03]
      CLOCK: [2015-07-06 Mo 17:03]--[2015-07-06 Mo 17:11] =>  0:08
      :END:
     :PROPERTIES:
     :Created: [2015-07-06 Mo 13:25]
     :Assigned_to: kordano
     :END:
**** References
**** License

Copyright © 2015 Konrad Kühne & Judith Massa

Distributed under the Eclipse Public License either version 1.0 or (at
your option) any later version.

